<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/QuickPose.h</key>
		<data>
		wTnXLDgDwMxeW4mqHigFDD2mMK8=
		</data>
		<key>Headers/QuickPoseCore-Swift.h</key>
		<data>
		b5FaJfqQqrye+eE4kENnm/4hN6M=
		</data>
		<key>Info.plist</key>
		<data>
		ilm+xPciBjEb6ZFqQ/adrfciEOY=
		</data>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<data>
		VJY82XcBr63ANH3FXrdK1La3tx8=
		</data>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<data>
		v2WNG95VlYdL1UdvLIUxwr6Ms+I=
		</data>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		fB83uRtEsQCKhFr+mcEFrAXNS0g=
		</data>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		v2WNG95VlYdL1UdvLIUxwr6Ms+I=
		</data>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		TDbG8XCTvYdV7PSbxm6ucEVZ9DQ=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		GthXHYcy1Sr3SvJIxzgeA4RXCxA=
		</data>
		<key>body_pose_clf.mlmodelc/analytics/coremldata.bin</key>
		<data>
		2I8GgD9pui5CoJPr7vVD0iK/71Y=
		</data>
		<key>body_pose_clf.mlmodelc/coremldata.bin</key>
		<data>
		5IwGdP8dDMcUDjWGNcJwUI0ECwg=
		</data>
		<key>body_pose_clf.mlmodelc/metadata.json</key>
		<data>
		yzpEcVU70OzBSxoP3qX3OTKeFXo=
		</data>
		<key>body_pose_clf.mlmodelc/model.espresso.net</key>
		<data>
		UGzf5gviWsVm0DC3GT0zz2BVWpU=
		</data>
		<key>body_pose_clf.mlmodelc/model.espresso.shape</key>
		<data>
		uMp6K9XNzI5+WeBTRLYJWoeJ/Q8=
		</data>
		<key>body_pose_clf.mlmodelc/model.espresso.weights</key>
		<data>
		PFR3x2RCrP6EF/WwVZMjZXx95o4=
		</data>
		<key>body_pose_clf.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>body_pose_clf.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>fitness_rep_clf.mlmodelc/_B0000.DAT</key>
		<data>
		hNLs5n5o+eQK8JuaRp4Deqxkows=
		</data>
		<key>fitness_rep_clf.mlmodelc/analytics/coremldata.bin</key>
		<data>
		mMByoffW+lhyezk+jwpHINhaPBc=
		</data>
		<key>fitness_rep_clf.mlmodelc/coremldata.bin</key>
		<data>
		pYS8VMro+BwqFtP+4iWMxVz8CFg=
		</data>
		<key>fitness_rep_clf.mlmodelc/metadata.json</key>
		<data>
		oJK/QiHusOzCFKBAxvAE35THb4c=
		</data>
		<key>hand_fingers_clf.mlmodelc/_B0000.DAT</key>
		<data>
		0U5lfigqrR5j7a8wvWtH8h18618=
		</data>
		<key>hand_fingers_clf.mlmodelc/analytics/coremldata.bin</key>
		<data>
		odN8sWOpFjZcjmtY3iE0dUAHsr0=
		</data>
		<key>hand_fingers_clf.mlmodelc/coremldata.bin</key>
		<data>
		FwgpSMT1GHZsHmxaG3ukxllVXmw=
		</data>
		<key>hand_fingers_clf.mlmodelc/metadata.json</key>
		<data>
		uWtOHl1nJxoqODFDCY2JutjS+hA=
		</data>
		<key>thumb_clf.mlmodelc/analytics/coremldata.bin</key>
		<data>
		R41UQVxSAhGnVUNhZdPllFI3Zm4=
		</data>
		<key>thumb_clf.mlmodelc/coremldata.bin</key>
		<data>
		ZkF7wbMskYG5oYj34jCpSL4E49o=
		</data>
		<key>thumb_clf.mlmodelc/metadata.json</key>
		<data>
		gWFbTWkZAyz6Lhny4ayHmaoIOVI=
		</data>
		<key>thumb_clf.mlmodelc/model.espresso.net</key>
		<data>
		uBY3KA7+t+U6uOQCI7GjDF5MMkc=
		</data>
		<key>thumb_clf.mlmodelc/model.espresso.shape</key>
		<data>
		JT7FSFSX0Gt71lpSV0RQpt8zBZw=
		</data>
		<key>thumb_clf.mlmodelc/model.espresso.weights</key>
		<data>
		xK6Cj/qV0f7v3x61+H0FFyfwGoo=
		</data>
		<key>thumb_clf.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>thumb_clf.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/QuickPose.h</key>
		<dict>
			<key>hash2</key>
			<data>
			n6J76Nky6Wf7EbufMGdIJC+/NPwfNz0ukO1UAxAhd4U=
			</data>
		</dict>
		<key>Headers/QuickPoseCore-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			5OJeZc6gMCB4V+QXhlyVbqdlz761/eyrozSJhrkmw9c=
			</data>
		</dict>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<dict>
			<key>hash2</key>
			<data>
			9re5jNMtl9htmZs5v0l0LmZq4gc8FhQgKY5R0U5TB9k=
			</data>
		</dict>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			ZclDl2L15yAqVJc5X1OR1yoW8EzrxvKr/ty6YMfM6qs=
			</data>
		</dict>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			D5XQR4bh3ZckCGqCqxxpCK62ZRMJR3hJxag54PL5X+I=
			</data>
		</dict>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			ZclDl2L15yAqVJc5X1OR1yoW8EzrxvKr/ty6YMfM6qs=
			</data>
		</dict>
		<key>Modules/QuickPoseCore.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			xFMyo+wcRjY9F1uYePwju2sJk6EvSMJnh0Vuz9EC2UQ=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			J9BkVMgOCG7BfBY4zbNM57BqO9Y5PwVWwQ/YqRP99+0=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WkYSAzNZWK2i9XoyqUe0aHJJ06JGse//Qncz/MTHbgI=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			qs48N+29gEzETSINhOsfI7W1MjYB7bPYDydykK4Xnzg=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			GlIadIxUSIohRZDt9ie1FJdMfEXACklbDUEut7zXI2w=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			O9PFxtjEihZkdOyOzDrhG0iQfNkEzMiRbbLc9WK92tw=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			fDYSkx5+ynwcccexEviMzlh5IOajEBg0jsd1lO5rd6g=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			2NJDw6v+ARZs7qOSSpAY2KwG1qx1ViGHNqZGSkaogYI=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>body_pose_clf.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>fitness_rep_clf.mlmodelc/_B0000.DAT</key>
		<dict>
			<key>hash2</key>
			<data>
			nf0u4ylcJy4InoMDzDJ67Z9rcpRRKu+/Rf1aZKbm1G4=
			</data>
		</dict>
		<key>fitness_rep_clf.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			GpLAtf90UTHtUu55kOuapWtvfIZ4MGuWorhCsjX8pzU=
			</data>
		</dict>
		<key>fitness_rep_clf.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			W1ZPn88XoiBsE5P7MGHlIi+fgYSvEWAJ5p2dwDUcrRY=
			</data>
		</dict>
		<key>fitness_rep_clf.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			ZL8xzEN3iPA/pwr6WC0WO7IXvhvAaQjez7md1ErPlpc=
			</data>
		</dict>
		<key>hand_fingers_clf.mlmodelc/_B0000.DAT</key>
		<dict>
			<key>hash2</key>
			<data>
			jyO2EDuVGrhxc1ErrFS2MThlfLSAx+yTWP3parqUDYg=
			</data>
		</dict>
		<key>hand_fingers_clf.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YpJ4KFxAX3qcfsdVWZv+VCa1zHumr9b2Mt4MhL46NUk=
			</data>
		</dict>
		<key>hand_fingers_clf.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			U4ZF4JtbN1bvUIkoEbLWC+ro7mD6UB+cpNI39OAiHoU=
			</data>
		</dict>
		<key>hand_fingers_clf.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			3qbOjtJDowxU1dFw8wY3O325nFjCWIZYFZu3qDrWd70=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			16TziEEK1xKGnrru8cECHvyKPAJ8XGrxYumC0i7pmW4=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			mS55A75Gi3NkQQVxmCPqe3jN+Vq5esr2DFE+TcZv4Aw=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			gjF6kU613SJx6x4wNvXhkDuMduE74G/HauZKHOZDat4=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			DE9polwCh71jlC4K5q+4w5+2uD3ubmzXIqk9xrhkKx0=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			o49r509pOcyo4vRFNeHf53Lg4WXLa/O/f7Kl/eUOky4=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			Wn0H6VuzFN7XneGD+8U1xJcwcOco0emyW9mJ861wIRE=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>thumb_clf.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
